Revit 2027 API
BuiltInFailures.SketchFailures.InvalidRoofCurveloop Property
 Base sketch for roof is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRoofCurveloop { get; }
Public Shared ReadOnly Property InvalidRoofCurveloop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRoofCurveloop {
	FailureDefinitionId^ get ();
}
static member InvalidRoofCurveloop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace